In [155]:
people = {
    "first": ["Robert", "John", "Jane"],
    "last": ["Stark", "Doe", "Doe"],
    "email": ["robstark@gmail.com", "johndoe@gmail.com", "janedoe@gmail.com"],
}


import pandas as pd

In [156]:
df = pd.DataFrame(people)

In [157]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    Jane    Doe   janedoe@gmail.com

In [158]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [159]:
df.columns = ["first_name", "last_name", "email"]

In [160]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [161]:
df.columns = [column.upper() for column in df.columns]
df.columns

Index(['FIRST_NAME', 'LAST_NAME', 'EMAIL'], dtype='object')

In [162]:
df.columns = df.columns.str.replace("_", " ")
df.columns

Index(['FIRST NAME', 'LAST NAME', 'EMAIL'], dtype='object')

In [163]:
df.columns = [column.lower() for column in df.columns]
df.columns = df.columns.str.replace(" ", "_")
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [164]:
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)

In [165]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    Jane    Doe   janedoe@gmail.com

In [166]:
df.loc[2]

first                 Jane
last                   Doe
email    janedoe@gmail.com
Name: 2, dtype: object

In [167]:
df.loc[2]  = ["John", "Smith", "JohnSmith@gmail.com"]

In [168]:
df

    first   last                email
0  Robert  Stark   robstark@gmail.com
1    John    Doe    johndoe@gmail.com
2    John  Smith  JohnSmith@gmail.com

In [169]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@gmail.com']

In [170]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    John    Doe   JohnDoe@gmail.com

In [171]:
df.loc[2, 'last'] = 'Smith'

In [172]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    John  Smith   JohnDoe@gmail.com

In [173]:
df.at[2, "last"] = "Doe"

In [174]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    John    Doe   JohnDoe@gmail.com

In [175]:
filter_ = df["email"] == "JohnDoe@gmail.com"
# df[filt]['last'] = 'Smith' # SettingWithCopyWarning we setting a value to copy object here
df.loc[filter_, "last"] = "Smith"  # correcct way

In [176]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    John  Smith   JohnDoe@gmail.com

In [177]:
df['email'].str.lower()

0    robstark@gmail.com
1     johndoe@gmail.com
2     johndoe@gmail.com
Name: email, dtype: object

In [178]:
df['email'] = df['email'].str.lower()

In [179]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    John  Smith   johndoe@gmail.com

In [181]:
# apply - use for calling a function on a value. Can be used on series and dfs

df['email'].apply(len)

0    18
1    17
2    17
Name: email, dtype: int64

In [183]:
def make_email_uppercase(email: str):
    return email.upper()

In [184]:
df['email'].apply(make_email_uppercase)

0    ROBSTARK@GMAIL.COM
1     JOHNDOE@GMAIL.COM
2     JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [186]:
df['email'] = df['email'].apply(make_email_uppercase)

In [187]:
df

    first   last               email
0  Robert  Stark  ROBSTARK@GMAIL.COM
1    John    Doe   JOHNDOE@GMAIL.COM
2    John  Smith   JOHNDOE@GMAIL.COM

In [189]:
df.apply(len) # lens of columns

first    3
last     3
email    3
dtype: int64

In [190]:
df.apply(pd.Series.min)

first                 John
last                   Doe
email    JOHNDOE@GMAIL.COM
dtype: object

In [192]:
 # applymap - only with df

df.applymap(len)

   first  last  email
0      6     5     18
1      4     3     17
2      4     5     17

In [196]:
# map -  only with series

df['first'].map({ "John": "Jack"})

0     NaN
1    Jack
2    Jack
Name: first, dtype: object